# St7SetVertexLabelStyle

Sets the display style for vertex labels.

long St7SetVertexLabelStyle(long uID, long LabelStyle)

Input Parameters

uID

Strand7 model file ID.

LabelStyle

One of lsNone, lsEntityNumber or lsIDNumber.

Dependencies
Font

Assigned using St7SetEntityFont.